app/controllers/adventures_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
	def new
		@current_user = User.find(session[:user_id])

SELECT  "prev_adventures".* FROM "prev_adventures" WHERE (adventure_id = '39' AND user_id = '3')  ORDER BY "prev_adventures"."id" DESC LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
	def show
	    @adv_id = params[:id]
	    @user_id = params[:user_id]
	    @current_adventure = PrevAdventure.where("adventure_id = ? AND user_id = ?", @adv_id, @user_id)

		#env variable key and HTTP response for Google API
		api_key = ENV["WING_IT_GOOGLE"]

		#for rendering page with their destination directions
		@adventure_choice = Adventure.find(params[:id])
		end_location = @adventure_choice.location
		@hint = @adventure_choice.hints
		@current_user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
	def create
		#gathering page information
		amount_time = params[:amount_time]
		amount_people = params[:amount_people]
		amount_spend = params[:amount_spend]
		mode_of_travel = params[:mode_of_travel]

		@user_id = params[:user_id]
		@current_user = User.find(session[:user_id])