app/controllers/prev_adventures_controller.rb

	def index
		# views user's past adventures
		@current_user = User.find(session[:user_id])
		@current_user.adventures
		# @prev_adven = Prev_Adventure.where(user_id: @current_user.id)
		if logged_in? && check_current_user?
			@current_user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "adventures".* FROM "adventures" INNER JOIN "prev_adventures" ON "adventures"."id" = "prev_adventures"."adventure_id" WHERE "prev_adventures"."user_id" = $1  [["user_id", 3]]

	def new
			# actual_user = User.find(session[:user_id])
		@current_user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

	def create

		if logged_in? && check_current_user? #this is our definition of logged in


			#logic for randomizer
			@new_array = Adventure.where("timeframe <= ? AND per_person <= ?", amount_time, amount_spend)
			@new_adventure = @new_array.sample

			#adventure id
			@adventure_id = @new_adventure.id
			#create the new previous adventure

			#check our work
			puts @new_adventure
			puts @new_prev_adventure

			redirect_to user_adventure_path(adventure)

			redirect_to '/users/2/prev_adventures'

		else
			@current_user = User.find(session[:user_id])
---
SELECT "adventures".* FROM "adventures" WHERE (timeframe <= '200' AND per_person <= '40')
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

			@new_adventure = @new_array.sample
	#adventure id
			@adventure_id = @new_adventure.id
				PrevAdventure.create({:user_id => @user_id, :adventure_id => @adventure_id, :mode_of_travel => @mode_of_travel})
---
INSERT INTO "prev_adventures" ("user_id", "adventure_id", "mode_of_travel", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["adventure_id", 57], ["mode_of_travel", "Walking"], ["created_at", "2015-09-02 18:59:46.793255"], ["updated_at", "2015-09-02 18:59:46.793255"]]