app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "Ethan@wingit.com"]]
---
	def create
		#logged in means a user_id is stored in a session
		user = User.find_by({email: params[:email]})